
/*************************功能说明********************************
实现电磁循迹

**************************头文件定义******************************/

#include "main.h"

/*************************变量定义********************************/


/*************************函数声明********************************/      

// 软件延时
void Delay(__IO uint32_t nCount);
//全部初始化
void AllInit(void);


/*************************主函数**********************************/ 
int main()
{
	AllInit();
	while(1)
	{
		
	}
}

/*************************函数定义*********************************/ 
void Delay(__IO uint32_t nCount)
{
  for(; nCount != 0; nCount--);
} 

/*************************初始化***********************************/ 
void AllInit(void)
{
	delay_init();	          //延时初始化
	TIM_PWM_Init();	        //舵机TIM2初始化
	USART_Config();         // 配置串口	
	ADCx_Init();            // ADC 初始化
	tim_motor_init();       //电机TIM1初始化
	TIM4_Init();            //定时器编码器接口初始化
	TIM3_Init();            //定时器编码器接口初始化
	TIM_Init(4999, 7199);		//编码器中断初始化,计数器频率=72M/(7199+1)=10kHz,10KHZ是0.1ms，一个定时器中断的时间=5000*（1/10）=500ms
	delay_init();           //延时初始化
	Led_Init(LED_ALL);      //led初始化
	TIM7_Init(19999,71);
	
}
